{"title":"anotherpedia:editpage-conner101ful","text":"Conner101ful#$$$#<<shortA person, probably...short>><<img(src=git/conner101ful.png(cap=The profile picture used by Conner101ful to represent himself.img>>{{bConner101ful}} is the [[username]] most commonly used by someone [[named|name]] Conner P. Conner101ful is a [[person]] who does many things [[online|internet]], such as playing [[video games|Video Game]], [[voice acting|Voice Actor]], [[game development|video game development]], and [[writing|Author]]. Outside his online life, not much happens personally. Conner101ful does not use much [[social media]]. They have a [[Discord|Discord (application)]], [[YouTube]], and [[Reddit]] account.<<hrCreative historyhr>><<hr2Writinghr2>>The writing career of Conner101ful started at around the age of 4. Despite the years spent writing, Conner101ful has never published a single piece of their writing, however, some of their writing is publically available for reading. Most, however, are kept a [[secret]]. Throughout his life, Conner101ful has been encouraged to continue pursuing his writing, and thanks to that encouragement, he never stopped. In his writing career, there have only been 2 times they have [[collaborated|Collaboration]] with anyone on a project. Both of those projects are not for public knowledge. Like most creatives, Conner101ful has experienced bouts of [[blockage|Creative Block]] for his creative mediums. Conner101ful also frequently deals with [[procrastonation]] and also deals demotivation from time to time.<<hr3List of currently publically available writing projectshr3>>;;{{i[[Grognak's Absurd Escapades|Grognak's Absurd Escapades (Conner101ful)]]}}|{{i[[Journey To The New World|Journey To The New World (Conner101ful)]]}}|{{i[[JoJo's Bizarre Adventure: Everywhere At The End Of Time|JoJo's Bizarre Adventure: Everywhere At The End Of Time (Conner101ful)]]}};;As of November 2024, the longest work made by Conner101ful is {{iGrognak's Absurd Escapades}}, which stands at over [[241,830]] words.<<hr2Voice actinghr2>>Conner101ful's history in voice acting began in 2022 when one of his [[friends|friend]] at [[school]] requested that he record himself shouting \"Mug Rootbeer\". Conner101ful did so and sent that friend the recording. It was later uploaded to that friend's YouTube channel, which Conner101ful was credited for the voice-over.<<ref(content=link|https://www.youtube.com/watch?v=Kt9Bz6flctA (text=refCountref>> This friend would later request more voice recording from Conner101ful. His next appearance would be as [[Badsmoke the Monster|Badsmoke (Rufusboy69)]]. The video for this would later become private. The next piece of voice acting Conner101ful did was when that friend requested he make a voice recording of [[Shadow The Hedgehog]].<<ref(content=link|https://www.youtube.com/watch?v=dA3Q34z5M7s (text=refCountref>> That was the last publically released instance of voice acting done by Conner101ful as of November 2024.<<hr2Game developmenthr2>><<hr3Early dayshr3>>As a young [[child]], Conner101ful dreamed of getting into game development. Eventually, much later in his life, Conner101ful would be made to use [[Scratch|Scratch (MIT)]] during one of his classes in school. His first ever game made using Scratch had been a barely functional [[clicker game]] centered around [[Champ99|Champ99 (Conner101ful)]] and his [[money]] [[factory]]. Champ99 would stick to Conner101ful's brain like glue. Future games would be centered around the character of Champ99 and this would later expand into a full-blown [[animated|animation]] series on scratch that never made it past 2 episodes and 3 parts of a 3rd episode. In addition, to the Champ99 series, sides series would be made that added upon the lore of the Champ99 series. However, those other side series would never see much work to them. After the creation of the 2nd episode of the Champ99 series, Conner would make his first playable game. It was titled \"Money Factory Mayhem\". The game was a top-down [[bullet hell]] game. In this game, the player would play as the [[Scratch Cat|Scratch Cat (MIT)]] and would be tasked with dodging a series of simple patterns to progress the game. Later, development would begin on a much more refined variation of the game that was intended to have 6 bosses. That remake would be partially made but never completed. Instead, a new game was being developed called \"Champ99 Project 1 ~ The Golden Amulet\". This would see development until the first boss and would never get picked up again. This led to the development of the Scratch version of \"Champ99 1 ~ Mystic Amulet\", which would get no more than basic movement and a simplistic title screen. Currently, all the Scratch Champ99 projects made by Conner101ful are private, but he does still have access to them.<<hr3Post-Scratchhr3>>During his junior year of [[high school]], Conner101ful would take a Computer Science Essentials class, taught by the person who would later make [[Pickcode]]. The class had started with block-based coding, which Conner101ful was quite familiar with from his experience in Scratch. His teacher was very good at their job and helped Conner101ful out greatly during times when he wanted to go above and beyond on projects. Later, the class would move beyond the block coding and move into [[Python|Python (Programming Language)]]. Towards the end of the year, the class was tasked with making a final project. Conner101ful had remembered the Champ99 series and decided to bring it back. His project was intended to be a 1-stage [[demo|Game Demo]] of {{iChamp99 1 ~ Mystic Amulet}}. Conner101ful, ever the star shooter, hit the moon instead, only getting as far as a basic movement demo complete with a \"focus mode\", \"power\" mechanics, and two distinct shot types. This project would later receive more development during his senior year of high school as he was taking a Computer Science Principals class. In that class, he learned more about [[Pygame]], which aided in the development of this Champ99 game.<<hr3Post-high schoolhr3>>When the seniors of his high school were made to leave and prepare for the graduation ceremony, Conner101ful's development for the 1st installment of the Champ99 Project series would continue in [[Pycharm|Pycharm (IDE)]]. This development was continued until testing for the [[danmaku|bullet hell]] system for the game. Conner101ful would get incredibly frustrated with it, as the game's frame rate would drop rapidly and the sprites for the bullets would become horrifically mangled. He would soon make the switch to the [[Godot|Godot (Game Engine)]]. Rebuilding the game from the ground up again went smoothly. As of November 2024, the development of {{iChamp99 1 ~ Mystic Amulet}} is on pause. During the Post-high school stage of development, the lore for the [[Champ99 series|Champ99 Project (Conner101ful)]] would expand greatly. Conner101ful would also start production of the 4th and final installment of the Champ99 Project series, a book titled {{iChamp99 Project 4: To Hell and Back}}. The 4th installment of the series reuses and remasters the plot of the 3rd installment of the original Champ99 animated series Conner101ful made on Scratch. As of the last page edit, this book is unfinished, but in its final stage of the [[first draft|Drafting (Writing)]]. During this era of his game development career Conner would also start working on a remastering of a [[Minecraft]] mod he made in between the Early Days era and Post-Scratch era.<<hr2YouTube channelhr2>>The name \"Conner101ful\" originally stemmed from the original Conner101ful YouTube channel owned by Conner. This channel would be made in 2012 and would consist of mainly {{i[[Minecraft]]}} and {{i[[Terraria]]}} content filmed from his [[Nintendo 3DS]] and uploaded to his channel from that very same console. Eventually, the content would move to being made from his computer. Then the original Conner101ful channel would be deleted due to the creator's own shame of his past. The channel would soon be remade with the same name in early 2021.<<ref(content=link|https://www.youtube.com/@conner101ful/videos (text=refCountref>> The channel solely consists of gameplay videos. The videos, as of November 2024, consist of replay file recordings of his gameplay in {{i[[Touhou Project]]}}.<<hrConner Lorehr>><<img(src=git/conner101ful poses.png(cap=Conner101ful as seen in an appearance in a scrapped [[mod|Game Mod]] for {{i[[Friday Night Funkin]]}}.img>>\"Conner Lore\" refers to the lore surrounding the guy who goes by Conner101ful. Conner Lore is mainly an inside joke among \r\nhis close friends. It gets increasingly more absurd with every expansion of the lore. This all started after the \"Great Falling Out\" where Conner left his previous friend group behind after a disagreement involving Conner101ful being seriously romantically attracted to and getting into a romantic relationship with the fictional character of [[Utsuho Reiuji|Utsuho Reiuji (Touhou Project)]]. During this period of Conner101ful's life when Conner101ful was settling himself in a new friend group that the Conner Lore began. At first, it began as Conner being a ghost because of his mic in a Discord call sounding like he was a considerable distance away. This spiraled into him being in [[The Backrooms]] and subsequently him transcending reality itself. Conner Lore continues to expand to this day, such as the time he battled his [[.EXE|.EXE (Creepypasta)]] or dabbled in [[ice cream]] merchandising. When asked about personal life, Conner101ful typically gives an answer under the canon of Conner Lore. He does this because it amuses him.#$$$#2024-11-21#$$$#Conner101ful#$$$#2024-11-27#$$$#Conner101ful"}