{"title":"anotherpedia:createpage-numeron dragon-+-(yu-gi-oh!)","text":"Numeron Dragon#$$$#{{tThis page is for the character, history, and legend surrounding the Numeron Dragon. for the card see [[Number 100: Numeron Dragon]].}}&sp\r\n\r\n<<img(src=https://dl.imgdrop.io/file/aed8b140-8472-4813-922b-7ce35ef93c9e/2024/08/23/1024px-DragonGodZEXALa3a6811a1acccb1f.png (cap=Numeron Dragon prior to being reborn as a [[Number|Numbers (Yu-Gi-Oh!)]] [[Monster|Monster (Yu-Gi-Oh!)]]. img>>\r\n\r\nNumeron Dragon is a character appearing in {{i[[Yu-Gi-Oh! ZEXAL|Yu-Gi-Oh!]]}}. It is the [[creator|creation]] of the [[universe]] and the [[Numeron Code|Numeron Code (Yu-Gi-Oh!)]]. Numeron Dragon is a large [[dragon]] resembling a Chinese dragon. It was eventually reborn as a Number Monster and played a huge role in the final fight against [[Don Thousand|Don Thousand (Yu-Gi-Oh!)]] as it directly resulted in the destruction of [[Number C1000: Numerounius]] and played a crucial role in boosting the attack points of [[Number 39: Utopia]] to allow it to beat over the [[100,000|100000]] [[attack points|Attack (Yu-Gi-Oh!)]] of [[Number iC1000: Numerounius Numerounia]].&sp\r\n\r\n<<hr Before Rebirth hr>>\r\nThe [[first]] bit of [[lore]] revealed about Numeron Dragon comes from the 133rd episode of {{iYu-Gi-Oh! ZEXAL}}. In That episode, it was revealed that the Numeron Dragon was the first being to exist. As the first being in existence, Numeron Dragon got lonely, and so it used its power to create the universe. However, doing so drained it of almost all of its power and nearly killed it. Wanting to see the future of its creation, Numeron Dragon shed one singular tear. That tear had travelled throughout the cosmos and eventually impacted the [[Earth]], and from that impact formed the [[Moon]]. That impact also buried the Numeron Code on Earth. The tear that impacted the Earth contained all the knowledge and emotions of Numeron Dragon. Numeron Dragon then used the power of the Numbers to hide away the existence of the Numeron Code. Lastly, Numeron Dragon left a record detailing the location of the key to the Numeron Code, after which, Numeron Dragon vanished.&sp\r\n<<hr Rebirth hr>>\r\nIn episode 134 of the Yu-Gi-Oh! ZEXAL anime, Numeron Dragon was reborn as Number 100: Numeron Dragon. During [[Kaito Tenjo|Kaito Tenjo (Yu-Gi-Oh!)]] and [[Mizael|Mizael (Yu-Gi-Oh!)]]'s duel on the Moon, the conditions specified in the [[Legend of the Dragons of Light and Time|Legend of the Dragons of Light and Time (Yu-Gi-Oh!)]] were met. [[Number 107: Galaxy-Eyes Tachyon Dragon]], [[Number 62: Galaxy-Eyes Prime Photon Dragon]], and [[Number 46: Dragluon]] resonated together, and summoned Numeron Dragon from the Moon. Numeron Dragon was reborn as Number 100: Numeron Dragon. As Kaito was dying, he entrusted Number 100: Numeron Dragon to Mizael.#$$$#2024-08-23#$$$#Conner101ful#$$$#2024-08-23#$$$#"}