{"title":"anotherpedia:createpage-xyz-+-summoning-+-(yu-gi-oh!)","text":"Xyz Summoning (Yu-Gi-Oh!)#$$$#<<img(src=https://dl.imgdrop.io/file/aed8b140-8472-4813-922b-7ce35ef93c9e/2024/08/26/NumberOverlayNetwork002c8a940423d149.png(cap=The Overlay Network as depicted when summoning [[Numbers|Numbers (Yu-Gi-Oh!)]] in [[Yu-Gi-Oh! ZEXAL|Yu-Gi-Oh!]].img>>\r\n\r\nXyz Summoning is the [[process]] of performing the {{i[[Yu-Gi-Oh!]]}} [[game|card game]] mechanic of an Xyz Summon. Xyz Summoning is a type of [[Special Summon|Special Summoning (Yu-Gi-Oh!)]] where the player overlays two or more [[Monsters|Monster (Yu-Gi-Oh!)]] with the same [[Level|Level (Yu-Gi-Oh!)]] or satisfies some other condition in order to Xyz Summon an Xyz Monster from their [[Extra Deck|Extra Deck (Yu-Gi-Oh!)]].&sp\r\n\r\n<<hr Xyz Monsters hr>>\r\nXyz Monsters are a type of Monster card that is placed in the Extra Deck. Xyz Monsters have a black card border. Xyz Monsters cannot exist in the [[hand|Hand (Yu-Gi-Oh!)]] or [[Main Deck|Main Deck (Yu-Gi-Oh!)]]. Instead of Levels, Xyz Monsters have [[Ranks|Rank (Yu-Gi-Oh!)]]. Since Xyz Monsters do not have Levels, any [[effect|Effects (Yu-Gi-Oh!)]] that depends on a Monster's Level do not affect Xyz Monsters and can not get involved with any actions that require Monsters with Levels. However, it is possible to give an Xyz Monster levels such as with the [[Pendulum|Pendulum Summoning (Yu-Gi-Oh!)]] effect of [[Xiangke Magician|Xiangke Magician (Yu-Gi-Oh!)]]. Xyz Monsters have what is called Xyz Materials. Xyz Materials are the cards that are underneath an Xyz Monster in their pile. Typically, an Xyz Material needs to be detached to activate an Xyz Monster's effect. When an Xyz material leaves the [[field|Field (Yu-Gi-Oh!)]], the Xyz Material of that Xyz Monster goes to the Graveyard. [[Tokens|Token Monsters (Yu-Gi-Oh!)]] can not be used as Xyz Material.\r\n&sp\r\n<<hr Mechanics hr>>\r\nDuring [[Main Phase 1|Main Phase (Yu-Gi-Oh!)]] or [[Main Phase 2|Main Phase 2 (Yu-Gi-Oh!)]], the [[turn player|Turn Player (Yu-Gi-Oh!)]] can Xyz Summon. They can Xyz Summon a monster to any available [[Main|Main Monster Zone (Yu-Gi-Oh!)]] or [[Extra Monster|Extra Monster Zone (Yu-Gi-Oh!)]] Zone on their side of the field unless otherwise stated. The turn player can also Xyz Summon with no empty Monster Zones should one of the materials used for the Xyz Summon occupy any of those Zones.\r\n\r\n&sp\r\n<<hr2 1 Material Xyz Summon hr2>>\r\n[[1]] Material Xyz Summon refers to the process of summoning an Xyz Monster by using only 1 material. Several cards have an effect that allows the player to perform an Xyz Summon using only 1 material. An example would be [[Number C39: Utopia Ray]] which effect states that the player is allowed to Xyz Summon it by using [[Number 39: Utopia]] as material.&sp\r\n\r\n<<hr2 Different Material Xyz Summon hr2>>\r\nDifferent Material Xyz Summon refers to the process of summoning an Xyz Monster by using other Monsters or cards that are being treated as valid material for an Xyz Summon requirement when they otherwise aren't. An example of this would be [[Dhampir Vampire Sheridan|Dhampir Vampire Sheridan (Yu-Gi-Oh!)]] which allows the player to Xyz Summon it using Monsters owned by the opponent, treating them as Level [[6]].&sp\r\n\r\n<<hr2 Card Effect Xyz Summon hr2>>\r\nCard Effect Xyz Summon refers to the process of a card effect performing an Xyz Summon after [[resolution|Resolve (Yu-Gi-Oh!)]]. An example of this would be [[Barian's Chaos Draw|Barian's Chaos Draw (Yu-Gi-Oh!)]] which has an effect that allows the player to Special Summon [[2]] Monster from the [[deck|Main Deck (Yu-Gi-Oh!)]] then makes the player Xyz Summon 1 \"Number\" Monster including both of those previously Special Summoned monsters as material.&sp\r\n\r\n<<hr2 Special Summon treated as an Xyz Summon hr2>>\r\nSome cards allow for the Special Summon of an Xyz Monster, but have that Special Summon be treated as an Xyz Summon. For example, if you Special Summon an Xyz Monster from the [[Graveyard|Graveyard (Yu-Gi-Oh!)]] using something like [[Monster Reborn|Monster Reborn (Yu-Gi-Oh!)]], that is not treated as an Xyz Summon but rather a Special Summon. An Example of a card that Special Summons an Xyz Monster and treats that Special Summon as an Xyz Summon would be [[Rank-Up-Magic - The Seventh One|Rank-Up-Magic - The Seventh One (Yu-Gi-Oh!)]] which states that the second Special Summon done by its effect is treated as an Xyz Summon.#$$$#2024-08-26#$$$#Conner101ful#$$$#2024-08-26#$$$#"}